; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Block grouping domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; A number of blocks of different colours lie on a grid-like environment.
;;; The objective is to group the blocks by colour, i.e. to have all blocks
;;; of the same color in the same cell, which is at the same time
;;; different to the cell where blocks of other colors are:
;;;
;;; forall i, j color(i) = color(j) <=> loc(i) = loc(j)
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain mt-block-grouping)
    ;(:requirements :typing )
    (:types block - object )
    (:functions
        (x ?b - block)  ;; The position of a block
        (y ?b - block)  ;;
        (max_x)
        (min_x)
        (max_y)
        (min_y)
    )

    ;; Move a block from its location to an adjacent location
    (:action move_block_up
     :parameters (?b - block)
     :precondition (and (<= (+ (y ?b)1) (max_y) ))
     :effect (and
        (increase (y ?b) 1)
    ))

    (:action move_block_down
     :parameters (?b - block)
     :precondition (and (>= (- (y ?b) 1) (min_y) ))
     :effect (and
        (decrease (y ?b) 1)
    ))

    (:action move_block_right
     :parameters (?b - block)
     :precondition (and (<= (+ (x ?b)1) (max_x) ))
     :effect (and
        (increase (x ?b) 1)
    ))

    (:action move_block_left
     :parameters (?b - block)
     :precondition (and (>= (- (x ?b) 1) (min_x) ))
     :effect (and
        (decrease (x ?b) 1)
    ))

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_25_5_2_2)
  (:domain mt-block-grouping)
  (:objects
    b1 b2 b3 b4 b5 - block
  )

  (:init
    (= (x b3) 11)
  (= (y b3) 16)
  (= (x b4) 23)
  (= (y b4) 22)
  (= (x b2) 13)
  (= (y b2) 18)
  (= (x b1) 9)
  (= (y b1) 12)
  (= (x b5) 8)
  (= (y b5) 6)
  (= (max_x) 25 )
  (= (min_x) 1 )
  (= (max_y) 25 )
  (= (min_y) 1 )
  )

  (:goal (and
    (= (x b1) (x b2))
(= (y b1) (y b2))
  (= (x b1) (x b3))
(= (y b1) (y b3))
  (or (not (= (x b1) (x b4))) (not (= (y b1) (y b4))))
  (= (x b1) (x b5))
(= (y b1) (y b5))
  (= (x b2) (x b3))
(= (y b2) (y b3))
  (or (not (= (x b2) (x b4))) (not (= (y b2) (y b4))))
  (= (x b2) (x b5))
(= (y b2) (y b5))
  (or (not (= (x b3) (x b4))) (not (= (y b3) (y b4))))
  (= (x b3) (x b5))
(= (y b3) (y b5))
  (or (not (= (x b4) (x b5))) (not (= (y b4) (y b5))))
  ))





)

; plan
1. (move_block_up b5)
   changed: (y b5) from 6 to 7
   goals met: 4 of 16
2. (move_block_up b5)
   changed: (y b5) from 7 to 8
   goals met: 4 of 16
3. (move_block_up b5)
   changed: (y b5) from 8 to 9
   goals met: 4 of 16
4. (move_block_up b5)
   changed: (y b5) from 9 to 10
   goals met: 4 of 16
5. (move_block_up b5)
   changed: (y b5) from 10 to 11
   goals met: 4 of 16
6. (move_block_up b5)
   changed: (y b5) from 11 to 12
   goals met: 5 of 16
7. (move_block_left b2)
   changed: (x b2) from 13 to 12
   goals met: 5 of 16
8. (move_block_left b2)
   changed: (x b2) from 12 to 11
   goals met: 6 of 16
9. (move_block_right b5)
   changed: (x b5) from 8 to 9
   goals met: 7 of 16
10. (move_block_down b2)
   changed: (y b2) from 18 to 17
   goals met: 7 of 16
11. (move_block_down b2)
   changed: (y b2) from 17 to 16
   goals met: 8 of 16
12. (move_block_up b1)
   changed: (y b1) from 12 to 13
   goals met: 7 of 16
13. (move_block_up b5)
   changed: (y b5) from 12 to 13
   goals met: 8 of 16
14. (move_block_up b1)
   changed: (y b1) from 13 to 14
   goals met: 7 of 16
15. (move_block_up b5)
   changed: (y b5) from 13 to 14
   goals met: 8 of 16
16. (move_block_up b1)
   changed: (y b1) from 14 to 15
   goals met: 7 of 16
17. (move_block_up b5)
   changed: (y b5) from 14 to 15
   goals met: 8 of 16
18. (move_block_up b1)
   changed: (y b1) from 15 to 16
   goals met: 9 of 16
19. (move_block_up b5)
   changed: (y b5) from 15 to 16
   goals met: 12 of 16
20. (move_block_left b3)
   changed: (x b3) from 11 to 10
   goals met: 11 of 16
21. (move_block_left b2)
   changed: (x b2) from 11 to 10
   goals met: 12 of 16
22. (move_block_left b3)
   changed: (x b3) from 10 to 9
   goals met: 13 of 16
23. (move_block_left b2)
   changed: (x b2) from 10 to 9
   goals met: 16 of 16
